{
  "motivationalMessages": [
    "You're making incredible progress, even when you don't feel it!",
    "Today's efforts are tomorrow's achievements. Keep going!",
    "Remember why you started, and be proud of how far you've come.",
    "Your dedication is inspiring - don't underestimate your impact.",
    "Small steps still move you forward. Celebrate every win!",
    "You've overcome challenges before, and you'll overcome this one too.",
    "Your resilience is your superpower. You've got this!",
    "Behind every success is countless hours of determination. Yours is showing.",
    "You're stronger than you think and braver than you believe.",
    "Your hard work is planting seeds for future success.",
    "Even on tough days, you're still making progress. Be kind to yourself.",
    "Your journey is unique - don't compare your chapter 1 to someone else's chapter 20.",
    "The fact that you're trying already puts you ahead of those who aren't.",
    "Success isn't always visible right away, but your efforts are never wasted.",
    "You have the power to turn obstacles into opportunities.",
    "Believe in yourself as much as others believe in you.",
    "Every expert was once a beginner. Keep learning and growing.",
    "Your potential is endless - you're just scratching the surface.",
    "Challenges are just opportunities to prove how badly you want something.",
    "You're not meant to blend in; your uniqueness is your strength.",
    "Progress isn't always linear, but you're still moving forward.",
    "The difference between ordinary and extraordinary is that little 'extra' you give.",
    "Your determination today is creating your success story for tomorrow.",
    "When you feel like giving up, remember why you started.",
    "Don't wait for opportunity - create it with your actions today.",
    "Your mindset determines your outcomes. Keep thinking positively!",
    "Your courage to continue is what distinguishes you.",
    "Difficult roads often lead to beautiful destinations. Keep going!",
    "Success is the sum of small efforts repeated day in and day out.",
    "You're not just surviving challenges - you're mastering them.",
    "The most rewarding things in life are often the most challenging.",
    "Your persistence is a measure of your belief in yourself.",
    "Each step forward is a step away from where you were before.",
    "You've survived 100% of your worst days so far. That's impressive!",
    "Your effort doesn't need to be perfect, it just needs to be persistent.",
    "Focus on progress, not perfection. You're doing great!",
    "The path to success is to take massive, determined action.",
    "Your future self is thanking you for not giving up today.",
    "Every accomplishment starts with the decision to try.",
    "Great things never came from comfort zones. Keep pushing boundaries!",
    "When you feel like quitting, think about why you started.",
    "Your work ethic today will determine your success tomorrow.",
    "Believe you can, and you're halfway there.",
    "Don't count the days, make the days count.",
    "You are exactly where you need to be right now.",
    "Your only limit is the one you set for yourself.",
    "Dream big, work hard, stay focused.",
    "The hardest part is starting. You've already begun!",
    "Take pride in how far you've come and have faith in how far you can go.",
    "Your positive attitude is your greatest asset. Keep shining!"
  ]
}